#include <iostream>
#include <Windows.h>
using namespace std;

// Функція, що знаходить суму парних дільників заданого числа
int func(int N) {
	// Створюємо змінну, що зберігатиме суму
	int sum = 0;

	// Перевіряємо чи парне дане число, якщо так, то одразу додаємо його до суми
	if (N % 2 == 0) {
		sum += N;
	}

	// Шукаємо серед парних чисел від 2 до N/2 (включно) дільники числа N та сумуємо їх
	// Пошук йде до N/2, бо N гарантовано не буде націло ділитись на числа більше своєї половини
	// (Окрім себе, але це вже враховано вище)
	for (int i = 2; i <= N / 2; i += 2) {
		if (N % i == 0) {
			sum += i;
		}
	}

	// Повертаємо значення суми
	return sum;
}

int main() {
	// Встановлюємо кодування виводу в консоль для коректного відображення кирилиці
	SetConsoleOutputCP(1251);

	// Створюємо змінну, що зберігатиме натуральне число
	int N;

	// Встановлюємо маркер, до якого повернеться програма у випадку некоректного вводу
restart:
	// Запитуємо у користувача натуральне число
	cout << "Введіть натуральне число: ";
	cin >> N;

	// Перевіряємо чи є введене число ненатуральним, якщо так, то повертаємося до маркера restart
	if (N <= 0) {
		cout << "Введене число не є натуральним! Спробуйте знову.\n";
		goto restart;
	}

	// Виводимо суму парних дільників
	cout << "Сума парних дільників даного числа: " << func(N);
}